Revit 2027 API
AssetProperty.RemoveConnectedAsset Method
 Removes the connected asset attached to this asset property if any.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveConnectedAsset()
Public Sub RemoveConnectedAsset
public:
void RemoveConnectedAsset()
member RemoveConnectedAsset : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace